# <span style="color:black">Imports of libraries</span>

In [1]:
import pandas as pd
# ! pip intall pandas
import numpy as np
import xlrd
import os 
import io
import math

In [2]:
%matplotlib inline

 ## <span style="color:black">Init constrains</span>

In [3]:
show_limit = 4

## Join two series into DF

In [4]:
# id of person
ID = np.random.randint(1000,9999,size=(5) ,dtype='int16')
# 2 columns
names =pd.Series(['Yossi','Ben','Josh','Ran','Asaf'],index=ID)
school =pd.Series(['Mekif h','Meakif Y','Mekif D','Mekif TV','Mekif TV'],index=ID)
#create frame
frame ={'Name': names, 'School': school}
df = pd.DataFrame(frame)

In [5]:
df

       Name    School
8098  Yossi   Mekif h
8538    Ben  Meakif Y
4020   Josh   Mekif D
5248    Ran  Mekif TV
1723   Asaf  Mekif TV

In [6]:
#Add another row 
age =pd.Series([17,16,18,17,16],index=ID)
age.name = 'Age'
df = pd.concat([df, age] , axis = 1 ,join='inner')

## Add another row

In [7]:
python_grade =pd.Series([80,82,78,92,100],index=ID)
df['Python Grade'] = python_grade

## Add another row

In [8]:
math_grade =pd.Series([83,89,78,92,75],index=ID)
df['Math Grade'] = math_grade

In [9]:
df['Average'] = (df['Math Grade'] + df['Python Grade'])/2

In [10]:
df

       Name    School  Age  Python Grade  Math Grade  Average
8098  Yossi   Mekif h   17            80          83     81.5
8538    Ben  Meakif Y   16            82          89     85.5
4020   Josh   Mekif D   18            78          78     78.0
5248    Ran  Mekif TV   17            92          92     92.0
1723   Asaf  Mekif TV   16           100          75     87.5

# Drop

## drop a row by the index (id)

In [11]:
#df.drop(6302 ,axis=0 , inplace=True)
#df.drop(6302 ,axis='index' , inplace=True)

In [12]:
df

       Name    School  Age  Python Grade  Math Grade  Average
8098  Yossi   Mekif h   17            80          83     81.5
8538    Ben  Meakif Y   16            82          89     85.5
4020   Josh   Mekif D   18            78          78     78.0
5248    Ran  Mekif TV   17            92          92     92.0
1723   Asaf  Mekif TV   16           100          75     87.5

## Drop a column

In [13]:
#df.drop(['Average','Math Grade'] ,axis='1' , inplace=True)
df.drop(['Average','Math Grade'] ,axis='columns' , inplace=True)

In [14]:
df

       Name    School  Age  Python Grade
8098  Yossi   Mekif h   17            80
8538    Ben  Meakif Y   16            82
4020   Josh   Mekif D   18            78
5248    Ran  Mekif TV   17            92
1723   Asaf  Mekif TV   16           100

# Update data

## Birthday func

In [15]:
def birthday( age : int) :
    return age+1

In [16]:
df['Age'] = df['Age'].apply(birthday)

In [17]:
df

       Name    School  Age  Python Grade
8098  Yossi   Mekif h   18            80
8538    Ben  Meakif Y   17            82
4020   Josh   Mekif D   19            78
5248    Ran  Mekif TV   18            92
1723   Asaf  Mekif TV   17           100

## Update a single value

In [18]:
df.loc[df['Name'] == 'Yossi', 'Python Grade'] = 100

## Get Yossi's ID

In [19]:
index_of_yossi = df.index[df['Name'] == 'Yossi'][0]

In [20]:
df.at[index_of_yossi, 'Age'] = 19

# Add data to the table

In [21]:
avner_data = ['Avner' ,'Mekif D',17,90 ]
df.loc[11111] = avner_data

In [22]:
shon_df =pd.DataFrame({'Name': 'Shon' ,'School': 'Mekif TV', 'Age': 17 , "Python Grade" : 99},index=[2222])
df = pd.concat([df,shon_df])

In [23]:
df

        Name    School  Age  Python Grade
8098   Yossi   Mekif h   19           100
8538     Ben  Meakif Y   17            82
4020    Josh   Mekif D   19            78
5248     Ran  Mekif TV   18            92
1723    Asaf  Mekif TV   17           100
11111  Avner   Mekif D   17            90
2222    Shon  Mekif TV   17            99

# Read data in two ways

In [24]:
df = pd.read_csv('imdb.csv')
df.sort_values(['Date'],ascending=False,inplace=True)
#df = pd.read_csv('imdb.txt', delimiter=',') 
df.head(show_limit)

,Name,Date,Rate,Votes,Genre,Duration,Type,Certificate,Episodes,Nudity,Violence,Profanity,Alcohol,Frightening
2992,Guardians of the Galaxy Vol. 3,2023,No Rate,No Votes,"Action, Adventure, Comedy",None,Film,None,-,No Rate,No Rate,No Rate,No Rate,No Rate
5554,Jonathan Creek,2023,8.1,"7,069","Comedy, Crime, Drama",60,Series,TV-MA,32,Moderate,Moderate,Moderate,No Rate,Mild
5872,One Foot in the Grave,2023,7.8,"6,070","Comedy, Drama",90,Series,TV-PG,44,None,Mild,Moderate,Mild,Mild
4722,One Foot in the Grave,2023,7.8,"6,070","Comedy, Drama",90,Series,TV-PG,44,None,Mild,Moderate,Mild,Mild

 # <span style="color:black">Get preffered data</span>

In [25]:
important_stat = df[['Name','Date','Rate','Genre','Certificate']]

In [26]:
important_stat.head(show_limit)

,Name,Date,Rate,Genre,Certificate
2992,Guardians of the Galaxy Vol. 3,2023,No Rate,"Action, Adventure, Comedy",None
5554,Jonathan Creek,2023,8.1,"Comedy, Crime, Drama",TV-MA
5872,One Foot in the Grave,2023,7.8,"Comedy, Drama",TV-PG
4722,One Foot in the Grave,2023,7.8,"Comedy, Drama",TV-PG

 # <span style="color:black">Craete a copy and clean invalid data into np.nan</span>

In [27]:
important_stat_with_nan = important_stat.copy()

In [28]:
important_stat_with_nan['Rate'] = important_stat_with_nan['Rate'].replace('No Rate', np.nan)

In [29]:
important_stat_with_nan['Rate'] = important_stat_with_nan['Rate'].astype(float)
#important_stat_with_nan.describe(include='all')

In [30]:
important_stat_with_nan.head(show_limit)

,Name,Date,Rate,Genre,Certificate
2992,Guardians of the Galaxy Vol. 3,2023,NaN,"Action, Adventure, Comedy",None
5554,Jonathan Creek,2023,8.1,"Comedy, Crime, Drama",TV-MA
5872,One Foot in the Grave,2023,7.8,"Comedy, Drama",TV-PG
4722,One Foot in the Grave,2023,7.8,"Comedy, Drama",TV-PG

 # <span style="color:black">Group by Genre and sort by rate</span>

In [31]:
rate_df = important_stat_with_nan.groupby('Genre')['Rate'].mean().sort_values(ascending=False)
print(rate_df.head(show_limit))
print(type(rate_df))

Genre
Animation, Family              9.6
Comedy, Game-Show              9.0
Comedy, History, News          8.9
Documentary, Drama, History    8.8
Name: Rate, dtype: float64
<class 'pandas.core.series.Series'>

 # <span style="color:black">Get a dataframe by condition</span>

In [32]:
condition_pass = important_stat_with_nan.loc[(important_stat_with_nan['Certificate'] == 'PG-13') & (important_stat_with_nan['Date'] == 2019)]

In [33]:
condition_pass.head(show_limit)

,Name,Date,Rate,Genre,Certificate
1406,Fighting with My Family,2019,7.1,"Biography, Comedy, Drama",PG-13
2203,The Hustle,2019,5.4,"Comedy, Crime",PG-13
491,After,2019,5.3,"Drama, Romance",PG-13
1479,Just Mercy,2019,7.6,"Biography, Crime, Drama",PG-13

 # <span style="color:black">iteration over rows Example</span>

In [34]:
counter = 0
for index, row in important_stat_with_nan.iterrows():
    if counter >= show_limit :
        break
    print(f'Row {index}:')
    print(f'Name: {row["Name"]}')
    print(f'Date: {row["Date"]}')
    print(f'Rate: {row["Rate"]}')
    print('---')
    counter+=1

Row 2992:
Name: Guardians of the Galaxy Vol. 3
Date: 2023
Rate: nan
---
Row 5554:
Name: Jonathan Creek
Date: 2023
Rate: 8.1
---
Row 5872:
Name: One Foot in the Grave
Date: 2023
Rate: 7.8
---
Row 4722:
Name: One Foot in the Grave
Date: 2023
Rate: 7.8
---

# Save to a new csv

In [35]:
name = 'important_stat_with_nan.csv'
folder_name = 'example_save_csv'
os.makedirs(folder_name, exist_ok=True)  
important_stat_with_nan.to_csv(f'{folder_name}/{name}', index=True)  
important_stat_with_nan.to_csv(f'{name}' , index=True)

# Open a csv file

## IO File

In [36]:
f = open('data_set_exmpl_csv_version.csv', "r")
print(f)
print(f.name)

<_io.TextIOWrapper name='data_set_exmpl_csv_version.csv' mode='r' encoding='cp1252'>
data_set_exmpl_csv_version.csv

In [37]:
for x in f:
  print(x)

ï»¿Name,Age,major

Itay,25,Computer Science

Tal,22,Philosophy

Aharon,19,Computer Science

Lev,26,Architecture

Noam,30,Architecture

Shir,18,Philosophy

In [38]:
f.close()

## Pandas reading

In [39]:
my_csv = pd.read_csv('data_set_exmpl_csv_version.csv')

In [40]:
print(type(my_csv))

<class 'pandas.core.frame.DataFrame'>

In [41]:
my_csv

     Name  Age             major
0    Itay   25  Computer Science
1     Tal   22        Philosophy
2  Aharon   19  Computer Science
3     Lev   26      Architecture
4    Noam   30      Architecture
5    Shir   18        Philosophy